[
  {
    "title": "Statistical Mechanics",
    "description": "This project contains series of notebooks, where we demonstrate some of the well known statistical mechanics algorithms implemented in Python. We closely follow the book by W. Krauth, et al., 'Statistical Mechanics: Algorithms and Computations', as well as some of his public lectures. Most of the algorithms are borrowed from this reference. Any errors are fully my responsibility.",
    "url": "#",
    "media": "https://placehold.it/700x400",
    "media2": "https://placehold.it/700x300"
  },

  {
    "title": "Portfolio Optimization",
    "description": "This is a collection of notebooks discussing various portfolio optimization algorithms. We discuss, analytic and numerical methods, with various realistic constraints.",
    "url": "#",
    "media": "https://placehold.it/700x400",
    "media2": "https://placehold.it/700x300"
  },

  {
    "title": "Time Series Forecast",
    "description": "This project contains series of notebooks with recipes for time series forecasting. We discuss simple ARIMA/GARCH models, hidden markov models, and extend it to models with recurrent neural networks (RNN/LSTM).",
    "url": "#",
    "media": "https://placehold.it/700x400",
    "media2": "https://placehold.it/700x300"
  },

  {
    "title": "Reinforcement Learning",
    "description": "In this project we present various applications of reinforcement learning techniques, as well as basic strategies often used in this area. We show an example of a simple trading machine that makes trading decisions based on the current state of the market.",
    "url": "#",
    "media": "https://placehold.it/700x400",
    "media2": "https://placehold.it/700x300"
  },

    {
    "title": "Quasinormal Modes",
    "description": "Here we examine some of the known algorithms to calculate quasinormal modes of various black holes.",
    "url": "#",
    "media": "https://placehold.it/700x400",
    "media2": "https://placehold.it/700x300"
  },

    {
    "title": "Sturm–Liouville Problems",
    "description": "Various numerical methods to find the eigenvalues/eigenstates corresponding to SL problem.",
    "url": "#",
    "media": "https://placehold.it/700x400",
    "media2": "https://placehold.it/700x300"
  }

]
