[
  {
    "title": "P1: Basic Monte-Carlo Methods",
    "description": "The defining character of Monte Carlo algorithms is the use of random numbers. These algorithms provide solutions by performing statistical sampling. We start by describing a simple method for estimating the value of π using direct sampling. Afterwards, we employ the Markov-chain approach to the same problem, and analyze the convergence of errors. One of the main pitfalls of these methods is the violation of ergodicity, that is the possibility that a Markov chain never visits all possible configurations. Finally, we remark on the nature of produced distribution, and attempt to generalize it.",
    "url": "P1_Basic_Monte_Carlo_Methods.html",
    "media": "data/buffon.png"
  },
  {
    "title": "P2: Markov-Chain Toy Model",
    "description": "Toy model is considered, where circle is randomly moving on a  3×3 grid. We verify that our algorithm after sufficiently many random steps sweeps out all accessible configurations evenly. We confirm the relation of eigenvalues of transfer matrix to asymptotic behavior and convergence of probabilities. We outline the detailed balance condition, and other primary conditions that Markov-chain algorithms should satisfy. We also discuss cases where broken reducibility or recurrence can be cured by the addition of an infinitesimal parameter. In conclusion, we extend our toy model to a non homogeneous case, and discuss Metropolis-Hastings algorithm.",
    "url": "P2_Markov_Chain_Toy_Model.html",
    "media": "data/pebble_dual_movie_epsilon_t.gif"
  },

    {
    "title": "P3: Sampling and Integration",
    "description": "We start by showing one of the ways one can sample gaussian distribution from uniform distribution. Then we show how to sample points uniformly on a sphere and on a ball, using either direct sampling or Markov-chain sampling. The latter algorithm allows to implement something like a random walk on a sphere. We discuss how Metropolis acceptance probability in Markov-chain method can be used to sample points from an arbitrary distribution, and other competing algorithms using direct sampling. We also discuss rejection free tower sampling and Walker algorithms. We consider an example of inverse square root distribution, and discuss how to solve problems associated with it. We conclude by calculating volume and area of the d-dimensional hypersphere using Monte Carlo methods.",
    "url": "P3_Sampling_and_Integration.html",
    "media": "data/random_walk_sphere_t.gif"
  },

    {
    "title": "P4: Generating Multicovariate Gaussian Distribution from Uniform",
    "description": "Using universality of uniform, we obtain standard normal distribution from the uniform distribution. We also show how to generate multicovariate gaussian distribution from standard normal distribution using Cholesky decomposition of covariance matrix. We check our results, and show how to calculate marginal and conditional distributions. The latter is proven to be useful in many instances.",
    "url": "P4_Generating_Distribution_from_Uniform_Using_Cholesky_Decomposition.html",
    "media": "data/conditional_distr.png"
  },

    {
    "title": "P5: From Classical Mechanics to Statistical Mechanics",
    "description": "We implement event-driven molecular dynamics algorithm to simulate system of hard disks in a box. We verify that the velocity distribution of one of the disks approaches Maxwell's distribution. We also demonstrate the onset of chaos with three disks. In addition, we observe a non uniform distribution of particle positions in a box, which is sometimes associated with the so called entropic interaction or \"the fifth force\". Furthermore, we discuss statistical ensembles, and how to sample legitimate configurations using either direct or Markov-chain Monte Carlo sampling for boxes with and without periodic boundary conditions. In all these cases, we test the equiprobability hypothesis, and the manifestation of the \"fifth force\". At the end we discuss virial expansion, and the \"geometric\" intuition behind Maxwell/Boltzmann distributions.",
    "url": "P5_From_Classical_to_Statistical_Mechanics.html",
    "media": "data/md_simulation_t.mp4"
  }

]

